# CheckMember

Check member base class

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.check_member import CheckMember

# TODO update the JSON string below
json = "{}"
# create an instance of CheckMember from a JSON string
check_member_instance = CheckMember.from_json(json)
# print the JSON string representation of the object
print(CheckMember.to_json())

# convert the object into a dict
check_member_dict = check_member_instance.to_dict()
# create an instance of CheckMember from a dict
check_member_from_dict = CheckMember.from_dict(check_member_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)